<a href="https://colab.research.google.com/github/youkyung2/dataAnalysis/blob/master/%EA%B2%B0%EC%B8%A1_%EC%B2%98%EB%A6%AC%ED%95%98%EA%B8%B0.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

* fillna()
* replace()
* interpolate()

## * **fillna()** 함수로 결측치 채우기

In [1]:
import pandas as pd
import numpy as np

In [11]:
# nan 값이 있는 데이터 프레임 만들기

dict = {'First Score' : [100, 90, np.nan, 95],
        'Second Score' : [30, 45, 56, np.nan],
        'Third Score' : [np.nan, 40, 80, 98]}

df = pd.DataFrame(dict)
df.head()

   First Score  Second Score  Third Score
0        100.0          30.0          NaN
1         90.0          45.0         40.0
2          NaN          56.0         80.0
3         95.0           NaN         98.0

#### 1 ) 특정한 단일값으로 채우기

In [6]:
df = df.fillna(0)
df.head()

   First Score  Second Score  Third Score
0        100.0          30.0          0.0
1         90.0          45.0         40.0
2          0.0          56.0         80.0
3         95.0           0.0         98.0

#### 2 ) 결측치 바로 이전의 값으로 채우기

In [8]:
df = df.fillna(method = 'pad')
df.head()

   First Score  Second Score  Third Score
0        100.0          30.0          NaN
1         90.0          45.0         40.0
2         90.0          56.0         80.0
3         95.0          56.0         98.0

#### 3 ) 결측치 바로 뒤의 값으로 채우기

In [10]:
df = df.fillna(method='bfill')
df.head()

   First Score  Second Score  Third Score
0        100.0          30.0         40.0
1         90.0          45.0         40.0
2         95.0          56.0         80.0
3         95.0           NaN         98.0

---

In [16]:
raw_data = {'first_name': ['Jason', np.nan, 'Tina', 'Jake', 'Amy'], 
            'last_name': ['Miller', np.nan, 'Ali', 'Milner', 'Cooze'], 
            'age': [42, np.nan, 36, 24, 73],
            'sex': ['m', np.nan, 'f', 'm', 'f'],
            'preTestScore': [4, np.nan, np.nan, 2, 3],
            'postTestScore': [25, np.nan, np.nan, 62, 70]}
df = pd.DataFrame(raw_data, columns = ['first_name', 'last_name', 'age', 'sex', 'preTestScore', 'postTestScore']) 
df

  first_name last_name   age  sex  preTestScore  postTestScore
0      Jason    Miller  42.0    m           4.0           25.0
1        NaN       NaN   NaN  NaN           NaN            NaN
2       Tina       Ali  36.0    f           NaN            NaN
3       Jake    Milner  24.0    m           2.0           62.0
4        Amy     Cooze  73.0    f           3.0           70.0

In [14]:
# 결측치 비율 확인하기
df.isnull().sum() / len(df) * 100

first_name       20.0
last_name        20.0
age              20.0
sex              20.0
preTestScore     40.0
postTestScore    40.0
dtype: float64

In [15]:
# 결측치 처리 방법
# X 변수 중 하나라도 결측치가 있다면 row제거
df.dropna()

  first_name last_name   age sex  preTestScore  postTestScore
0      Jason    Miller  42.0   m           4.0           25.0
3       Jake    Milner  24.0   m           2.0           62.0
4        Amy     Cooze  73.0   f           3.0           70.0

In [17]:
# X 변수가 전부 결측치 일 경우에 row 제거
df.dropna(how = 'all') # how='all' : 모든 X 변수가 NaN 일 때만 row drop

  first_name last_name   age sex  preTestScore  postTestScore
0      Jason    Miller  42.0   m           4.0           25.0
2       Tina       Ali  36.0   f           NaN            NaN
3       Jake    Milner  24.0   m           2.0           62.0
4        Amy     Cooze  73.0   f           3.0           70.0

In [18]:
# X 변수가 전부 결측치 일 경우에 column 제거
df.dropna(axis=1, how='all')

  first_name last_name   age  sex  preTestScore  postTestScore
0      Jason    Miller  42.0    m           4.0           25.0
1        NaN       NaN   NaN  NaN           NaN            NaN
2       Tina       Ali  36.0    f           NaN            NaN
3       Jake    Milner  24.0    m           2.0           62.0
4        Amy     Cooze  73.0    f           3.0           70.0

In [19]:
# n개 미만의 X변수가 valid 하면 drop
df.dropna(thresh  = 1) # 1개 이상의 Nan 데이터 있을 때 drop

# 각 row별로 thresh 갯수 이상의 valid data 가 있을 경우에는 두고,
# thresh 개수 미만의 valid data 가 있을 경우에는 drop

  first_name last_name   age sex  preTestScore  postTestScore
0      Jason    Miller  42.0   m           4.0           25.0
2       Tina       Ali  36.0   f           NaN            NaN
3       Jake    Milner  24.0   m           2.0           62.0
4        Amy     Cooze  73.0   f           3.0           70.0

In [49]:
# 평균값으로 결측치 대체
cleaned_df = df.dropna(axis = 1, how = 'all')
cleaned_df = df.dropna(axis = 0, how = 'all')
print(cleaned_df)

fillna_df = cleaned_df.copy()
fillna_df['preTestScore'] = cleaned_df['preTestScore'].fillna(cleaned_df['preTestScore'].mean())
print(fillna_df)

  first_name last_name   age sex  preTestScore  postTestScore
0      Jason    Miller  42.0   m           4.0           25.0
2       Tina       Ali  36.0   f           NaN            NaN
3       Jake    Milner  24.0   m           2.0           62.0
4        Amy     Cooze  73.0   f           3.0           70.0
  first_name last_name   age sex  preTestScore  postTestScore
0      Jason    Miller  42.0   m           4.0           25.0
2       Tina       Ali  36.0   f           3.0            NaN
3       Jake    Milner  24.0   m           2.0           62.0
4        Amy     Cooze  73.0   f           3.0           70.0

In [39]:
# postTestScore가 Nan 인 값에 '70' 넣기

fillna_df.loc[fillna_df['postTestScore'].isnull(),'postTestScore'] = 70
fillna_df

  first_name last_name   age sex  preTestScore  postTestScore
0      Jason    Miller  42.0   m           4.0           25.0
2       Tina       Ali  36.0   f           3.0           70.0
3       Jake    Milner  24.0   m           2.0           62.0
4        Amy     Cooze  73.0   f           3.0           70.0

In [23]:
# 그룹별 평균값으로 결측치 대체하기
cleaned_df.groupby('sex')['postTestScore'].mean()

sex
f    70.0
m    43.5
Name: postTestScore, dtype: float64

In [42]:
fillna_df['postTestScore'] = cleaned_df['postTestScore'].fillna(
    cleaned_df.groupby('sex')['postTestScore'].transform('mean'))
fillna_df

# 결측인 데이터의 sex=f 라서, f의 평균인 '70' 이 들어갔다. 
# transform : 각 요소별로 다중함수 적용
# agg() 메서드는 sum,mean 등 집계하는 함수 위주로 적용됨

  first_name last_name   age sex  preTestScore  postTestScore
0      Jason    Miller  42.0   m           4.0           25.0
2       Tina       Ali  36.0   f           3.0           70.0
3       Jake    Milner  24.0   m           2.0           62.0
4        Amy     Cooze  73.0   f           3.0           70.0

In [44]:
fillna_df['postTestScore'] = cleaned_df['postTestScore'].fillna(
    cleaned_df.groupby('sex')['postTestScore'].mean())
fillna_df

  first_name last_name   age sex  preTestScore  postTestScore
0      Jason    Miller  42.0   m           4.0           25.0
2       Tina       Ali  36.0   f           3.0            NaN
3       Jake    Milner  24.0   m           2.0           62.0
4        Amy     Cooze  73.0   f           3.0           70.0

In [50]:
fillna_df['postTestScore'] = cleaned_df['postTestScore'].fillna(
    cleaned_df.groupby('sex')['postTestScore'].agg('mean'))
fillna_df

  first_name last_name   age sex  preTestScore  postTestScore
0      Jason    Miller  42.0   m           4.0           25.0
2       Tina       Ali  36.0   f           3.0            NaN
3       Jake    Milner  24.0   m           2.0           62.0
4        Amy     Cooze  73.0   f           3.0           70.0

In [51]:
cleaned_df.groupby('sex')['postTestScore'].agg('mean')

sex
f    70.0
m    43.5
Name: postTestScore, dtype: float64